tangyangguang/Esp32_Fan_4P/test/test_fan_controller.cpp
#include <unity.h>

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "Arduino.h"
#include "Esp32Base.h"

static uint32_t g_mockMillis = 0;
static uint8_t g_pinMode[64] = {};
static uint8_t g_pinState[64] = {};
static uint8_t g_pwmValue[64] = {};
static void (*g_isr[64])() = {};
static bool g_restartCalled = false;

uint32_t millis() { return g_mockMillis; }
void yield() {}
void delay(uint32_t ms) { g_mockMillis += ms; }
void pinMode(uint8_t pin, uint8_t mode) { g_pinMode[pin] = mode; }
uint8_t digitalRead(uint8_t pin) { return g_pinState[pin]; }
void digitalWrite(uint8_t pin, uint8_t val) { g_pinState[pin] = val; }
void analogWriteFreq(uint32_t) {}
void analogWrite(uint8_t pin, uint8_t val) { g_pwmValue[pin] = val; }
void attachInterrupt(uint8_t pin, void (*handler)(), int) { g_isr[pin] = handler; }
void detachInterrupt(uint8_t pin) { g_isr[pin] = nullptr; }
uint8_t digitalPinToInterrupt(uint8_t pin) { return pin; }
void noInterrupts() {}
void interrupts() {}

ESPClass ESP;
void ESPClass::restart() { g_restartCalled = true; }
bool ESPClass::restartCalled() {
    const bool called = g_restartCalled;
    g_restartCalled = false;
    return called;
}

WiFiClass WiFi;

namespace {
struct IntEntry {
    char ns[16];
    char key[16];
    int32_t value;
    bool used;
};
struct BoolEntry {
    char ns[16];
    char key[16];
    bool value;
    bool used;
};
struct StrEntry {
    char ns[16];
    char key[16];
    char value[64];
    bool used;
};

IntEntry g_ints[80] = {};
BoolEntry g_bools[24] = {};
StrEntry g_strs[12] = {};
bool g_configReady = false;
bool g_wifiConnected = true;
bool g_wifiPowerSave = false;
bool g_libraryNamespacesCleared = false;
char g_authUser[32] = "admin";
char g_authPass[32] = "admin";
bool g_authEnabled = true;
bool g_flushFail = false;
uint16_t g_flushCount = 0;
uint16_t g_wifiClearCount = 0;
bool g_configAuditEnabled = false;
bool g_configReadAuditEnabled = false;
uint8_t g_addPageCount = 0;
uint8_t g_addApiCount = 0;
char g_failAddPagePath[32] = "";
char g_failAddApiPath[32] = "";
char g_failSetIntKey[16] = "";
char g_failSetBoolKey[16] = "";
char g_failSetStrKey[16] = "";
bool g_wifiClearFail = false;
char g_chunkBody[20000] = "";

struct WebParam {
    char name[32];
    char value[128];
};
WebParam g_params[12] = {};
uint8_t g_paramCount = 0;
Esp32BaseWeb::Method g_method = Esp32BaseWeb::METHOD_GET;
int g_lastCode = 0;
char g_lastBody[1024] = "";

int findInt(const char* ns, const char* key) {
    for (uint8_t i = 0; i < 80; ++i) {
        if (g_ints[i].used && strcmp(g_ints[i].ns, ns) == 0 && strcmp(g_ints[i].key, key) == 0) return i;
    }
    return -1;
}

int findBool(const char* ns, const char* key) {
    for (uint8_t i = 0; i < 24; ++i) {
        if (g_bools[i].used && strcmp(g_bools[i].ns, ns) == 0 && strcmp(g_bools[i].key, key) == 0) return i;
    }
    return -1;
}

int findStr(const char* ns, const char* key) {
    for (uint8_t i = 0; i < 12; ++i) {
        if (g_strs[i].used && strcmp(g_strs[i].ns, ns) == 0 && strcmp(g_strs[i].key, key) == 0) return i;
    }
    return -1;
}

void webReset() {
    memset(g_params, 0, sizeof(g_params));
    g_paramCount = 0;
    g_method = Esp32BaseWeb::METHOD_GET;
    g_lastCode = 0;
    g_lastBody[0] = '\0';
    g_chunkBody[0] = '\0';
}

void webSetMethod(Esp32BaseWeb::Method method) {
    g_method = method;
}

void webSetParam(const char* name, const char* value) {
    if (g_paramCount >= 12) return;
    strncpy(g_params[g_paramCount].name, name, sizeof(g_params[g_paramCount].name) - 1);
    strncpy(g_params[g_paramCount].value, value, sizeof(g_params[g_paramCount].value) - 1);
    ++g_paramCount;
}
}

bool Esp32BaseConfig::begin() {
    g_configReady = true;
    return true;
}
void Esp32BaseConfig::handle() {}
bool Esp32BaseConfig::isReady() { return g_configReady; }
bool Esp32BaseConfig::setStr(const char* ns, const char* key, const char* value) {
    if (strcmp(ns, "fan") == 0 && strcmp(key, g_failSetStrKey) == 0) return false;
    int idx = findStr(ns, key);
    if (idx < 0) {
        for (uint8_t i = 0; i < 12; ++i) {
            if (!g_strs[i].used) {
                idx = i;
                g_strs[i].used = true;
                strncpy(g_strs[i].ns, ns, sizeof(g_strs[i].ns) - 1);
                strncpy(g_strs[i].key, key, sizeof(g_strs[i].key) - 1);
                break;
            }
        }
    }
    if (idx < 0) return false;
    strncpy(g_strs[idx].value, value ? value : "", sizeof(g_strs[idx].value) - 1);
    return true;
}
bool Esp32BaseConfig::getStr(const char* ns, const char* key, char* out, size_t len, const char* def) {
    if (!out || len == 0) return false;
    const int idx = findStr(ns, key);
    strncpy(out, idx >= 0 ? g_strs[idx].value : (def ? def : ""), len - 1);
    out[len - 1] = '\0';
    return idx >= 0;
}
bool Esp32BaseConfig::setInt(const char* ns, const char* key, int32_t value) {
    if (strcmp(ns, "fan") == 0 && strcmp(key, g_failSetIntKey) == 0) return false;
    int idx = findInt(ns, key);
    if (idx < 0) {
        for (uint8_t i = 0; i < 80; ++i) {
            if (!g_ints[i].used) {
                idx = i;
                g_ints[i].used = true;
                strncpy(g_ints[i].ns, ns, sizeof(g_ints[i].ns) - 1);
                strncpy(g_ints[i].key, key, sizeof(g_ints[i].key) - 1);
                break;
            }
        }
    }
    if (idx < 0) return false;
    g_ints[idx].value = value;
    return true;
}
int32_t Esp32BaseConfig::getInt(const char* ns, const char* key, int32_t def) {
    const int idx = findInt(ns, key);
    return idx >= 0 ? g_ints[idx].value : def;
}
bool Esp32BaseConfig::setIntDeferred(const char* ns, const char* key, int32_t value, uint32_t) {
    return setInt(ns, key, value);
}
bool Esp32BaseConfig::setBool(const char* ns, const char* key, bool value) {
    if (strcmp(ns, "fan") == 0 && strcmp(key, g_failSetBoolKey) == 0) return false;
    int idx = findBool(ns, key);
    if (idx < 0) {
        for (uint8_t i = 0; i < 24; ++i) {
            if (!g_bools[i].used) {
                idx = i;
                g_bools[i].used = true;
                strncpy(g_bools[i].ns, ns, sizeof(g_bools[i].ns) - 1);
                strncpy(g_bools[i].key, key, sizeof(g_bools[i].key) - 1);
                break;
            }
        }
    }
    if (idx < 0) return false;
    g_bools[idx].value = value;
    return true;
}
bool Esp32BaseConfig::getBool(const char* ns, const char* key, bool def) {
    const int idx = findBool(ns, key);
    return idx >= 0 ? g_bools[idx].value : def;
}
bool Esp32BaseConfig::setBoolDeferred(const char* ns, const char* key, bool value, uint32_t) {
    return setBool(ns, key, value);
}
bool Esp32BaseConfig::setStrDeferred(const char* ns, const char* key, const char* value, uint32_t) {
    return setStr(ns, key, value);
}
bool Esp32BaseConfig::flushAll() {
    ++g_flushCount;
    return !g_flushFail;
}
bool Esp32BaseConfig::clearNamespace(const char* ns) {
    for (auto& item : g_ints) if (item.used && strcmp(item.ns, ns) == 0) item.used = false;
    for (auto& item : g_bools) if (item.used && strcmp(item.ns, ns) == 0) item.used = false;
    for (auto& item : g_strs) if (item.used && strcmp(item.ns, ns) == 0) item.used = false;
    return true;
}
bool Esp32BaseConfig::clearLibraryNamespaces() {
    g_libraryNamespacesCleared = true;
    return true;
}
void Esp32BaseConfig::enableConfigAudit(bool enabled) { g_configAuditEnabled = enabled; }
void Esp32BaseConfig::enableConfigReadAudit(bool enabled) { g_configReadAuditEnabled = enabled; }

bool Esp32BaseWiFi::isConnected() { return g_wifiConnected; }
bool Esp32BaseWiFi::ip(char* out, size_t len) {
    if (!out || len == 0) return false;
    strncpy(out, "192.168.4.10", len - 1);
    out[len - 1] = '\0';
    return true;
}
int32_t Esp32BaseWiFi::rssi() { return -61; }
void Esp32BaseWiFi::setPowerSave(bool enabled) { g_wifiPowerSave = enabled; }
bool Esp32BaseWiFi::powerSave() { return g_wifiPowerSave; }
bool Esp32BaseWiFi::clearCredentials() {
    ++g_wifiClearCount;
    return !g_wifiClearFail;
}
Esp32BaseWiFi::State Esp32BaseWiFi::state() { return CONNECTED; }
const char* Esp32BaseWiFi::stateName() { return "CONNECTED"; }

bool Esp32BaseNtp::isTimeSynced() { return true; }
bool Esp32BaseNtp::formatTime(char* out, size_t len, const char*) {
    if (!out || len == 0) return false;
    strncpy(out, "2026-05-07 12:00:00", len - 1);
    out[len - 1] = '\0';
    return true;
}

bool Esp32BaseWeb::checkAuth() { return true; }
void Esp32BaseWeb::setDefaultAuth(const char* user, const char* pass) {
    strncpy(g_authUser, user ? user : "", sizeof(g_authUser) - 1);
    strncpy(g_authPass, pass ? pass : "", sizeof(g_authPass) - 1);
}
const char* Esp32BaseWeb::authUser() { return g_authUser; }
bool Esp32BaseWeb::isAuthEnabled() { return g_authEnabled; }
void Esp32BaseWeb::setAuthEnabled(bool enabled) { g_authEnabled = enabled; }
bool Esp32BaseWeb::verifyAuth() { return true; }
bool Esp32BaseWeb::verifyAuth(const char* user, const char* pass) {
    return strcmp(g_authUser, user ? user : "") == 0 && strcmp(g_authPass, pass ? pass : "") == 0;
}
bool Esp32BaseWeb::saveAuth(const char* user, const char* pass) {
    setDefaultAuth(user, pass);
    return true;
}
bool Esp32BaseWeb::resetAuth() { return true; }
bool Esp32BaseWeb::addPage(const char* path, const char*, Handler) {
    ++g_addPageCount;
    return strcmp(path ? path : "", g_failAddPagePath) != 0;
}
bool Esp32BaseWeb::addApi(const char* path, Handler) {
    ++g_addApiCount;
    return strcmp(path ? path : "", g_failAddApiPath) != 0;
}
bool Esp32BaseWeb::addNavItem(const char*, const char*) { return true; }
bool Esp32BaseWeb::setDeviceName(const char*) { return true; }
bool Esp32BaseWeb::setHomePath(const char*) { return true; }
void Esp32BaseWeb::setHomeMode(HomeMode) {}
void Esp32BaseWeb::setSystemNavMode(SystemNavMode) {}
bool Esp32BaseWeb::setBuiltinLabel(BuiltinPage, const char*) { return true; }
Esp32BaseWeb::Method Esp32BaseWeb::currentMethod() { return g_method; }
bool Esp32BaseWeb::isMethod(Method method) { return method == METHOD_ANY || g_method == method; }
const char* Esp32BaseWeb::currentMethodName() { return g_method == METHOD_POST ? "POST" : "GET"; }
bool Esp32BaseWeb::hasParam(const char* name) {
    for (uint8_t i = 0; i < g_paramCount; ++i) {
        if (strcmp(g_params[i].name, name) == 0) return true;
    }
    return false;
}
bool Esp32BaseWeb::getParam(const char* name, char* out, size_t len) {
    if (!out || len == 0) return false;
    for (uint8_t i = 0; i < g_paramCount; ++i) {
        if (strcmp(g_params[i].name, name) == 0) {
            strncpy(out, g_params[i].value, len - 1);
            out[len - 1] = '\0';
            return true;
        }
    }
    return false;
}
void Esp32BaseWeb::sendHeader(const char*) {}
void Esp32BaseWeb::sendFooter() {}
void Esp32BaseWeb::sendChunk(const char* text) {
    if (!text) return;
    const size_t used = strlen(g_chunkBody);
    const size_t available = sizeof(g_chunkBody) - used - 1;
    if (available == 0) return;
    strncat(g_chunkBody, text, available);
}
void Esp32BaseWeb::writeHtmlEscaped(const char*) {}
void Esp32BaseWeb::sendText(int code, const char* text) { sendJson(code, text ? text : ""); }
void Esp32BaseWeb::sendHtml(int code, const char* html) { sendJson(code, html ? html : ""); }
void Esp32BaseWeb::sendJson(int code, const char* json) {
    g_lastCode = code;
    strncpy(g_lastBody, json ? json : "", sizeof(g_lastBody) - 1);
    g_lastBody[sizeof(g_lastBody) - 1] = '\0';
}

#include "fan/ButtonDriver.h"
#include "fan/FanController.h"
#include "fan/FanDriver.h"
#include "fan/IRReceiverDriver.h"
#include "fan/LedIndicator.h"
#include "web/FanWeb.h"
#include "app/FanAppRuntime.h"

