tangyangguang/Esp32_Fan_4P/test/test_fan_controller.cpp
void setUp() {
    g_mockMillis = 0;
    memset(g_pinMode, 0, sizeof(g_pinMode));
    memset(g_pinState, HIGH, sizeof(g_pinState));
    memset(g_pwmValue, 0, sizeof(g_pwmValue));
    memset(g_isr, 0, sizeof(g_isr));
    memset(g_ints, 0, sizeof(g_ints));
    memset(g_bools, 0, sizeof(g_bools));
    memset(g_strs, 0, sizeof(g_strs));
    g_restartCalled = false;
    g_configReady = false;
    g_wifiConnected = true;
    g_wifiPowerSave = false;
    g_libraryNamespacesCleared = false;
    strcpy(g_authUser, "admin");
    strcpy(g_authPass, "admin");
    g_authEnabled = true;
    g_flushFail = false;
    g_flushCount = 0;
    g_wifiClearCount = 0;
    g_configAuditEnabled = false;
    g_configReadAuditEnabled = false;
    g_addPageCount = 0;
    g_addApiCount = 0;
    g_failAddPagePath[0] = '\0';
    g_failAddApiPath[0] = '\0';
    g_failSetIntKey[0] = '\0';
    g_failSetBoolKey[0] = '\0';
    g_failSetStrKey[0] = '\0';
    g_wifiClearFail = false;
    webReset();
}

void tearDown() {}

static void makeController(FanDriver& fan, ButtonDriver& btn, LedIndicator& led,
                           IRReceiverDriver& ir, FanController& controller) {
    (void)fan;
    (void)btn;
    (void)led;
    (void)ir;
    TEST_ASSERT_TRUE(controller.begin());
}

void test_fan_driver_begin_and_soft_start() {
    FanDriver fan(5, 12);
    TEST_ASSERT_TRUE(fan.begin());
    TEST_ASSERT_EQUAL(OUTPUT, g_pinMode[5]);
    TEST_ASSERT_EQUAL(INPUT_PULLUP, g_pinMode[12]);
    TEST_ASSERT_EQUAL(FAN_STATE_IDLE, fan.getState());

    TEST_ASSERT_TRUE(fan.setSpeed(50));
    TEST_ASSERT_EQUAL(FAN_STATE_SOFT_START, fan.getState());
    g_mockMillis = 1200;
    fan.tick();
    TEST_ASSERT_EQUAL(50, fan.getSpeed());
    TEST_ASSERT_EQUAL(FAN_STATE_RUNNING, fan.getState());
}

void test_fan_driver_rpm_and_block_detection() {
    FanDriver fan(5, 12);
    fan.begin();
    fan.setSoftStartTime(0);
    fan.setBlockDetectTime(1000);
    TEST_ASSERT_TRUE(fan.setSpeed(50));
    TEST_ASSERT_EQUAL(FAN_STATE_RUNNING, fan.getState());

    for (uint8_t i = 0; i < 2; ++i) {
        g_isr[12]();
    }
    g_mockMillis = 500;
    fan.tick();
    TEST_ASSERT_EQUAL(120, fan.getRpm());

    g_mockMillis = 1100;
    fan.tick();
    g_mockMillis = 2200;
    fan.tick();
    TEST_ASSERT_TRUE(fan.isBlocked());
    TEST_ASSERT_EQUAL(0, fan.getSpeed());
}

void test_button_driver_short_press_and_both_long() {
    ButtonDriver buttons(14, 4);
    TEST_ASSERT_TRUE(buttons.begin());

    g_pinState[14] = LOW;
    buttons.getEvent();
    g_mockMillis = 60;
    TEST_ASSERT_EQUAL(BTN_NONE, buttons.getEvent());
    g_pinState[14] = HIGH;
    buttons.getEvent();
    g_mockMillis = 130;
    TEST_ASSERT_EQUAL(BTN_ACCEL_SHORT, buttons.getEvent());

    g_pinState[4] = LOW;
    buttons.getEvent();
    g_mockMillis = 200;
    buttons.getEvent();
    g_pinState[4] = HIGH;
    buttons.getEvent();
    g_mockMillis = 270;
    TEST_ASSERT_EQUAL(BTN_DECEL_SHORT, buttons.getEvent());

    g_pinState[14] = LOW;
    g_pinState[4] = LOW;
    buttons.getEvent();
    g_mockMillis = 340;
    buttons.getEvent();
    g_mockMillis = 5400;
    TEST_ASSERT_EQUAL(BTN_BOTH_LONG, buttons.getEvent());
}

void test_controller_factory_reset_clears_app_and_library_namespaces() {
    Esp32BaseConfig::setInt("fan", "min_spd", 20);
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    TEST_ASSERT_TRUE(controller.resetFactory());
    TEST_ASSERT_TRUE(ESP.restartCalled());
    TEST_ASSERT_EQUAL(10, Esp32BaseConfig::getInt("fan", "min_spd", 10));
    TEST_ASSERT_TRUE(g_libraryNamespacesCleared);
}

void test_app_runtime_registers_routes_and_enables_audit() {
    fanAppConfigureBaseWebBeforeBegin();
    TEST_ASSERT_EQUAL_STRING("admin", Esp32BaseWeb::authUser());

    TEST_ASSERT_TRUE(fanAppRegisterFanRoutes());
    TEST_ASSERT_EQUAL(2, g_addPageCount);
    TEST_ASSERT_EQUAL(6, g_addApiCount);

    fanAppEnableConfigAuditBeforeBegin();
    TEST_ASSERT_TRUE(g_configAuditEnabled);
    TEST_ASSERT_TRUE(g_configReadAuditEnabled);
}

void test_app_runtime_reports_route_registration_failure() {
    strcpy(g_failAddApiPath, "/api/stop");

    TEST_ASSERT_FALSE(fanAppRegisterFanRoutes());
    TEST_ASSERT_EQUAL(2, g_addPageCount);
    TEST_ASSERT_EQUAL(6, g_addApiCount);
}

void test_app_runtime_boot_button_clear_wifi_timing() {
    BootClearState state = {};
    const uint8_t bootPin = 0;

    g_pinState[bootPin] = LOW;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_FALSE(state.armed);
    TEST_ASSERT_EQUAL(0, g_wifiClearCount);

    g_pinState[bootPin] = HIGH;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_TRUE(state.armed);

    g_mockMillis = 10;
    g_pinState[bootPin] = LOW;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_EQUAL(0, g_wifiClearCount);
    TEST_ASSERT_FALSE(ESP.restartCalled());

    g_mockMillis = 5009;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_EQUAL(0, g_wifiClearCount);

    g_mockMillis = 5010;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_EQUAL(1, g_wifiClearCount);
    TEST_ASSERT_GREATER_THAN_UINT16(0, g_flushCount);
    TEST_ASSERT_TRUE(ESP.restartCalled());

    g_mockMillis = 9000;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_EQUAL(1, g_wifiClearCount);
}

void test_app_runtime_boot_button_clear_wifi_failure_skips_restart() {
    BootClearState state = {};
    const uint8_t bootPin = 0;

    g_pinState[bootPin] = HIGH;
    fanAppHandleBootButton(bootPin, &state);
    TEST_ASSERT_TRUE(state.armed);

    g_wifiClearFail = true;
    g_mockMillis = 10;
    g_pinState[bootPin] = LOW;
    fanAppHandleBootButton(bootPin, &state);
    g_mockMillis = 5010;
    fanAppHandleBootButton(bootPin, &state);

    TEST_ASSERT_EQUAL(1, g_wifiClearCount);
    TEST_ASSERT_FALSE(ESP.restartCalled());
}

void test_controller_config_timer_restore_and_sleep() {
    Esp32BaseConfig::setInt("fan", "min_spd", 15);
    Esp32BaseConfig::setInt("fan", "soft_on", 0);
    Esp32BaseConfig::setInt("fan", "blk_ms", 60000);
    Esp32BaseConfig::setInt("fan", "last_spd", 50);
    Esp32BaseConfig::setInt("fan", "last_tim", 120);
    Esp32BaseConfig::setBool("fan", "restore", true);

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    TEST_ASSERT_EQUAL(15, controller.getMinEffectiveSpeed());
    TEST_ASSERT_EQUAL(50, controller.getCurrentSpeed());
    TEST_ASSERT_EQUAL(120, controller.getTimerRemaining());
    TEST_ASSERT_EQUAL(SYS_RUNNING, controller.getState());

    controller.setTimer(2);
    g_mockMillis = 1000;
    controller.tick();
    TEST_ASSERT_EQUAL(1, controller.getTimerRemaining());
    g_mockMillis = 2000;
    controller.tick();
    TEST_ASSERT_EQUAL(0, controller.getTimerRemaining());

