tangyangguang/Esp32_Fan_4P/test/test_fan_controller.cpp
    controller.setSleepWaitTime(1);
    controller.setSoftStopTime(0);
    controller.stop();
    g_mockMillis = 4000;
    controller.tick();
    g_mockMillis = 5100;
    controller.tick();
    TEST_ASSERT_EQUAL(SYS_SLEEP, controller.getState());
    TEST_ASSERT_TRUE(Esp32BaseWiFi::powerSave());
}

void test_controller_force_save_flushes_runtime_state() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);
    controller.setSoftStartTime(0);
    g_flushCount = 0;

    TEST_ASSERT_TRUE(controller.setSpeed(40));
    TEST_ASSERT_GREATER_THAN_UINT16(0, g_flushCount);
    TEST_ASSERT_EQUAL(40, Esp32BaseConfig::getInt("fan", "last_spd", 0));

    g_flushCount = 0;
    TEST_ASSERT_TRUE(controller.stop());
    TEST_ASSERT_GREATER_THAN_UINT16(0, g_flushCount);
    TEST_ASSERT_EQUAL(0, Esp32BaseConfig::getInt("fan", "last_spd", 99));
}

void test_controller_flush_failure_returns_false_and_rolls_back_visible_state() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);
    controller.setSoftStartTime(0);
    controller.setBlockDetectTime(60000);

    g_flushFail = true;
    TEST_ASSERT_FALSE(controller.setSpeed(40));
    TEST_ASSERT_EQUAL(0, controller.getTargetSpeed());
    TEST_ASSERT_EQUAL(0, controller.getCurrentGear());
    TEST_ASSERT_EQUAL(0, controller.getCurrentSpeed());
    TEST_ASSERT_EQUAL(FAN_STATE_IDLE, fan.getState());
    TEST_ASSERT_EQUAL(0, g_pwmValue[5]);

    TEST_ASSERT_FALSE(controller.setTimer(60));
    TEST_ASSERT_EQUAL(0, controller.getTimerRemaining());

    g_flushFail = false;
    TEST_ASSERT_TRUE(controller.setSpeed(40));
    g_flushFail = true;
    TEST_ASSERT_FALSE(controller.stop());
    TEST_ASSERT_EQUAL(40, controller.getTargetSpeed());
    TEST_ASSERT_EQUAL(2, controller.getCurrentGear());
    TEST_ASSERT_EQUAL(40, controller.getCurrentSpeed());
    TEST_ASSERT_EQUAL(FAN_STATE_RUNNING, fan.getState());
    TEST_ASSERT_GREATER_THAN_UINT8(0, g_pwmValue[5]);
}

void test_controller_ir_persist_failure_keeps_memory_state() {
    Esp32BaseConfig::setStr("fan", "ir_2", "1:0000000000001234");

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    uint8_t proto = 0;
    uint64_t code = 0;
    TEST_ASSERT_TRUE(ir.getKeyCode(2, &proto, &code));
    TEST_ASSERT_EQUAL(1, proto);
    TEST_ASSERT_EQUAL_UINT64(0x1234ULL, code);

    g_flushFail = true;
    TEST_ASSERT_EQUAL(IR_CODE_SAVE_FAILED, controller.clearIRCode(2));
    TEST_ASSERT_TRUE(ir.getKeyCode(2, &proto, &code));
    TEST_ASSERT_EQUAL(1, proto);
    TEST_ASSERT_EQUAL_UINT64(0x1234ULL, code);

    g_flushFail = false;
    TEST_ASSERT_EQUAL(IR_CODE_CHANGED, controller.clearIRCode(2));
    TEST_ASSERT_TRUE(ir.getKeyCode(2, &proto, &code));
    TEST_ASSERT_EQUAL(0, proto);
    TEST_ASSERT_EQUAL_UINT64(0ULL, code);
    TEST_ASSERT_EQUAL(IR_CODE_NO_CHANGE, controller.clearIRCode(2));
}

void test_controller_ir_learn_save_failure_restores_previous_code() {
    Esp32BaseConfig::setStr("fan", "ir_1", "1:0000000000001234");

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    TEST_ASSERT_TRUE(ir.testLearnDecoded(1, 2, 0x5678ULL));
    g_flushFail = true;
    controller.tick();

    uint8_t proto = 0;
    uint64_t code = 0;
    TEST_ASSERT_TRUE(ir.getKeyCode(1, &proto, &code));
    TEST_ASSERT_EQUAL(1, proto);
    TEST_ASSERT_EQUAL_UINT64(0x1234ULL, code);
}

void test_controller_auto_restore_enable_saves_current_state() {
    Esp32BaseConfig::setBool("fan", "restore", false);
    Esp32BaseConfig::setInt("fan", "soft_on", 0);
    Esp32BaseConfig::setInt("fan", "blk_ms", 60000);

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);
    TEST_ASSERT_FALSE(controller.getAutoRestore());

    TEST_ASSERT_TRUE(controller.setSpeed(35));
    TEST_ASSERT_EQUAL(0, Esp32BaseConfig::getInt("fan", "last_spd", 0));
    g_flushCount = 0;

    TEST_ASSERT_TRUE(controller.setAutoRestore(true));
    TEST_ASSERT_TRUE(controller.getAutoRestore());
    TEST_ASSERT_GREATER_THAN_UINT16(0, g_flushCount);
    TEST_ASSERT_EQUAL(35, Esp32BaseConfig::getInt("fan", "last_spd", 0));
}

void test_controller_min_speed_change_reapplies_low_target() {
    Esp32BaseConfig::setInt("fan", "soft_on", 0);
    Esp32BaseConfig::setInt("fan", "blk_ms", 60000);

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    TEST_ASSERT_TRUE(controller.setSpeed(12));
    TEST_ASSERT_EQUAL(12, controller.getTargetSpeed());
    TEST_ASSERT_TRUE(controller.setMinEffectiveSpeed(25));
    TEST_ASSERT_EQUAL(25, controller.getTargetSpeed());
    TEST_ASSERT_EQUAL(25, controller.getCurrentSpeed());
}

void test_controller_runtime_save_failure_retries_next_tick() {
    Esp32BaseConfig::setInt("fan", "soft_on", 0);
    Esp32BaseConfig::setInt("fan", "blk_ms", 60000);

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);
    TEST_ASSERT_TRUE(controller.setRuntimeSaveIntervalMinutes(1));
    TEST_ASSERT_TRUE(controller.setSpeed(40));

    strcpy(g_failSetIntKey, "run_s");
    g_mockMillis = 61000;
    controller.tick();
    TEST_ASSERT_EQUAL(0, Esp32BaseConfig::getInt("fan", "run_s", 0));

    g_failSetIntKey[0] = '\0';
    g_mockMillis = 62000;
    controller.tick();
    TEST_ASSERT_EQUAL(62, Esp32BaseConfig::getInt("fan", "run_s", 0));
}

