tangyangguang/Esp32_Fan_4P/test/test_fan_controller.cpp
void test_controller_ignores_negative_persisted_values() {
    Esp32BaseConfig::setInt("fan", "min_spd", -1);
    Esp32BaseConfig::setInt("fan", "soft_on", 0);
    Esp32BaseConfig::setInt("fan", "blk_ms", 60000);
    Esp32BaseConfig::setInt("fan", "last_spd", 150);
    Esp32BaseConfig::setInt("fan", "last_tim", -20);
    Esp32BaseConfig::setInt("fan", "run_s", -42);
    Esp32BaseConfig::setBool("fan", "restore", true);

    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);

    TEST_ASSERT_EQUAL(10, controller.getMinEffectiveSpeed());
    TEST_ASSERT_EQUAL(100, controller.getTargetSpeed());
    TEST_ASSERT_EQUAL(0, controller.getTimerRemaining());
    TEST_ASSERT_EQUAL(0, controller.getTotalRunDuration());
}

void test_controller_error_recovery_window_not_reset_by_repeated_speed() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    makeController(fan, buttons, led, ir, controller);
    controller.setSoftStartTime(0);
    controller.setBlockDetectTime(100);

    TEST_ASSERT_TRUE(controller.setSpeed(50));
    g_mockMillis = 200;
    controller.tick();
    g_mockMillis = 350;
    controller.tick();
    TEST_ASSERT_EQUAL(SYS_ERROR, controller.getState());

    TEST_ASSERT_TRUE(controller.setSpeed(50));
    TEST_ASSERT_EQUAL(SYS_RECOVERING, controller.getState());
    g_mockMillis = 450;
    TEST_ASSERT_TRUE(controller.setSpeed(60));
    TEST_ASSERT_EQUAL(SYS_RECOVERING, controller.getState());

    g_mockMillis = 1000;
    controller.tick();
    TEST_ASSERT_EQUAL(SYS_ERROR, controller.getState());
}

void test_web_api_speed_timer_config_and_ir() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);
    controller.setSoftStartTime(0);
    controller.setBlockDetectTime(60000);

    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("speed", "75");
    FanWeb::handleApiSpeed();
    TEST_ASSERT_EQUAL(200, g_lastCode);
    TEST_ASSERT_EQUAL(75, controller.getTargetSpeed());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"target_speed\":75"));

    webReset();
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("seconds", "7200");
    FanWeb::handleApiTimer();
    TEST_ASSERT_EQUAL(200, g_lastCode);
    TEST_ASSERT_EQUAL(7200, controller.getTimerRemaining());

    webReset();
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("min_speed", "22");
    FanWeb::handleApiConfig();
    TEST_ASSERT_EQUAL(200, g_lastCode);
    TEST_ASSERT_EQUAL(22, controller.getMinEffectiveSpeed());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"changed\":1"));

    webReset();
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("key_index", "2");
    FanWeb::handleApiIrLearn();
    TEST_ASSERT_EQUAL(200, g_lastCode);
    TEST_ASSERT_TRUE(ir.isLearning());
    TEST_ASSERT_EQUAL(2, ir.getLearnedKeyIndex());
}

void test_web_config_write_failure_returns_error_without_applying() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);
    strcpy(g_failSetIntKey, "min_spd");

    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("min_speed", "22");
    FanWeb::handleApiConfig();

    TEST_ASSERT_EQUAL(500, g_lastCode);
    TEST_ASSERT_EQUAL(10, controller.getMinEffectiveSpeed());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":false"));
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"changed\":0"));

    g_failSetIntKey[0] = '\0';
    g_flushFail = true;
    webReset();
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("min_speed", "25");
    webSetParam("soft_start", "2500");
    FanWeb::handleApiConfig();

    TEST_ASSERT_EQUAL(500, g_lastCode);
    TEST_ASSERT_EQUAL(10, controller.getMinEffectiveSpeed());
    TEST_ASSERT_EQUAL(1000, controller.getSoftStartTime());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":false"));
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"changed\":0"));
}

void test_web_runtime_save_failure_returns_error() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);
    controller.setSoftStartTime(0);
    controller.setBlockDetectTime(60000);

    g_flushFail = true;
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("seconds", "60");
    FanWeb::handleApiTimer();
    TEST_ASSERT_EQUAL(500, g_lastCode);
    TEST_ASSERT_EQUAL(0, controller.getTimerRemaining());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":false"));

    g_flushFail = false;
    TEST_ASSERT_TRUE(controller.setSpeed(40));
    g_flushFail = true;
    webReset();
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    FanWeb::handleApiStop();
    TEST_ASSERT_EQUAL(500, g_lastCode);
    TEST_ASSERT_EQUAL(40, controller.getTargetSpeed());
    TEST_ASSERT_EQUAL(40, controller.getCurrentSpeed());
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":false"));
}

void test_web_ir_clear_failure_returns_error() {
    Esp32BaseConfig::setStr("fan", "ir_2", "1:0000000000001234");
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);

    g_flushFail = true;
    webSetMethod(Esp32BaseWeb::METHOD_POST);
    webSetParam("key_index", "2");
    webSetParam("clear", "1");
    FanWeb::handleApiIrLearn();

