tangyangguang/Esp32_Fan_4P/test/test_fan_controller.cpp
    TEST_ASSERT_EQUAL(500, g_lastCode);
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":false"));
}

void test_web_pages_emit_html_chunks() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);

    FanWeb::handleStatusPage();
    TEST_ASSERT_NOT_NULL(strstr(g_chunkBody, "id=outTop"));
    TEST_ASSERT_NOT_NULL(strstr(g_chunkBody, "id=sv"));

    webReset();
    FanWeb::handleConfigPage();
    TEST_ASSERT_NOT_NULL(strstr(g_chunkBody, "name=min_speed"));
    TEST_ASSERT_NOT_NULL(strstr(g_chunkBody, "fetch('/api/config'"));
}

void test_web_api_status() {
    FanDriver fan(5, 12);
    ButtonDriver buttons(14, 4);
    LedIndicator led(2, true);
    IRReceiverDriver ir(13);
    FanController controller(fan, buttons, led, ir);
    FanWeb web(controller, ir);
    (void)web;
    makeController(fan, buttons, led, ir, controller);

    FanWeb::handleApiStatus();
    TEST_ASSERT_EQUAL(200, g_lastCode);
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ok\":true"));
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"ip\":\"192.168.4.10\""));
    TEST_ASSERT_NOT_NULL(strstr(g_lastBody, "\"clock\":\"2026-05-07 12:00:00\""));
}

int main(int, char**) {
    UNITY_BEGIN();
    RUN_TEST(test_fan_driver_begin_and_soft_start);
    RUN_TEST(test_fan_driver_rpm_and_block_detection);
    RUN_TEST(test_button_driver_short_press_and_both_long);
    RUN_TEST(test_app_runtime_registers_routes_and_enables_audit);
    RUN_TEST(test_app_runtime_reports_route_registration_failure);
    RUN_TEST(test_app_runtime_boot_button_clear_wifi_timing);
    RUN_TEST(test_app_runtime_boot_button_clear_wifi_failure_skips_restart);
    RUN_TEST(test_controller_config_timer_restore_and_sleep);
    RUN_TEST(test_controller_force_save_flushes_runtime_state);
    RUN_TEST(test_controller_flush_failure_returns_false_and_rolls_back_visible_state);
    RUN_TEST(test_controller_ir_persist_failure_keeps_memory_state);
    RUN_TEST(test_controller_ir_learn_save_failure_restores_previous_code);
    RUN_TEST(test_controller_auto_restore_enable_saves_current_state);
    RUN_TEST(test_controller_min_speed_change_reapplies_low_target);
    RUN_TEST(test_controller_runtime_save_failure_retries_next_tick);
    RUN_TEST(test_controller_ignores_negative_persisted_values);
    RUN_TEST(test_controller_error_recovery_window_not_reset_by_repeated_speed);
    RUN_TEST(test_controller_factory_reset_clears_app_and_library_namespaces);
    RUN_TEST(test_web_api_speed_timer_config_and_ir);
    RUN_TEST(test_web_config_write_failure_returns_error_without_applying);
    RUN_TEST(test_web_runtime_save_failure_returns_error);
    RUN_TEST(test_web_ir_clear_failure_returns_error);
    RUN_TEST(test_web_pages_emit_html_chunks);
    RUN_TEST(test_web_api_status);
    return UNITY_END();
}
